report/siege_ddos_results.txt
## LOB Engine Benchmark - siege --content-type "application/json" -c 200 -t 30S
## Environment: C++20/Drogon LOB engine, Docker Desktop, Apple M2 Air

### Result (insertion throughput):

Transactions:               99537    hits
Availability:                100.00 %
Elapsed time:                 30.99 secs
Response time:                62.05 ms
Transaction rate:           3211.91 trans/sec
Concurrency:                 199.28
Successful transactions:    99537
Failed transactions:             0
Longest transaction:          720.00 ms
Shortest transaction:           0.00 ms

### Result (full match + Kafka throughput, crossing prices):

Transactions:               35327    hits
Availability:                100.00 %
Elapsed time:                 30.50 secs
Response time:               159.28 ms
Transaction rate:           1158.26 trans/sec
Concurrency:                 184.49
Successful transactions:    35327
Failed transactions:             0
Longest transaction:         2800.00 ms
Shortest transaction:           0.00 ms

### Notes:
- 200 concurrent clients, 30 seconds sustained, both runs 100% availability
- Insertion run: orders at non-crossing prices (pure order book insertion throughput)
- Matching run: crossing prices trigger full match + Kafka publish per trade (~100ms/trade overhead)
- Bottleneck in matching run is Kafka round-trip, not the C++ Red-Black Tree engine
- Environment: Docker Desktop Linux VM on macOS adds hypervisor overhead on all network calls
- Native bare-metal estimate: 10-50x higher throughput
